サイバー攻撃　大量のデータ送ったり、不正侵入してデータ盗む
情報資産　企業が守るべきデータ
人的脅威　人が直接かかわる
技術的脅威　マルウェアによる攻撃
物理的脅威　災害や物理的に破壊する
脆弱性　セキュリティ上の欠陥
不正　内部のものがシステム破壊すること

クラッキング　ネットワークを通じて他人のPCに入り情報盗んだり、破壊すること
ソーシャルエンジニアリング　本人を装ってパスワード聞くこと
スパイウェア　ユーザーが認識せず悪意のあるプログラムインストールさせ個人情報盗む
ぼっと　ネットワークを通じてたにんのPC 操る
トロイの木馬　有益なソフトウェアに見せかけてインストール後悪意のある動作をする
ルートきっと　サーバにバックドアを作り、サーバ内への侵入痕跡を隠ぺいするなどあるソフト

クラッカー　サイバー攻撃など行う人
ホワイトハッカー　サーバー攻撃からシステムを守る

ブルートフォース攻撃　（総当たり攻撃）　あらゆる文字列試す
辞書に載っている単語を試す　辞書攻撃
ほかのサービスで流出したパスワードを使う　パスワードリスト攻撃
システム側の対策　二段階認証を用いる
ユーザー側　パスワードを定期的に変更する

クロスサイトスクリプティング　攻撃者はスクリプト（js）付きの入力し、ほかのユーザーのブラウザ上で実行させ
cookieなどの情報を盗む

SQLインジェクション　WEBサイトの画面からデータ送信するときSQLを実行させデータを盗み出す
DNSキャッシュポイズニング　DNSキャッシュサーバ（ホストとIPアドレス変換）を書き換えユーザを悪因あるサイトに誘導
クロスサイトリクエストフォージェリ（CSRF）
ほかのサイトを通じて、標的となるページに強制的にリクエストを送らせて、オンラインショッピングの注文などさせる
クリックジャッキング　ボタンやリンクを透明にして押したら悪意のサイトへ行くなどする
ディレクトリトラバーサル　アクセス禁止のファイルを見るコウゲキ

